import sqlite3

conn = sqlite3.connect('data/database.db')
cursor = conn.cursor()

raw_data = [("Носов Иван Михайлович", "89210563128", "login1", "pass1", "Менеджер"),
            ("Ильин Александр Андреевич", "89535078985", "login2", "pass2", "Мастер"),
            ("Никифоров Иван Дмитриевич", "89210673849", "login3", "pass3", "Мастер"),
            ("Елисеев Артём Леонидович", "89990563748", "login4", "pass4", "Оператор"),
            ("Титов Сергей Кириллович", "89994563847", "login5", "pass5", "Оператор"),
            ("Григорьев Семён Викторович", "89219567849", "login11", "pass11", "Заказчик"),
            ("Сорокин Дмитрий Ильич", "89219567841", "login12", "pass12", "Заказчик"),
            ("Белоусов Егор Ярославович", "89219567842", "login13", "pass13", "Заказчик"),
            ("Суслов Михаил Александрович", "89219567843", "login14", "pass14", "Заказчик"),
            ("Васильев Вячеслав Александрович", "89219567844", "login15", "pass15", "Мастер")]

for data in raw_data:
    cursor.execute('''
        INSERT INTO Users (fio, phone, login, password, type)
        VALUES (?,?,?,?,?)
    ''', data)

conn.commit()
cursor.close()
